#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ФотоНажатие(Элемент, СтандартнаяОбработка)

	#Если МобильноеПриложениеКлиент Тогда
		
	СтандартнаяОбработка = Ложь;
		
	Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
		НовоеФото = СредстваМультимедиа.СделатьФотоснимок();
		Если НовоеФото = Неопределено Тогда
			Возврат
		КонецЕсли;
		ДвоичныеДанные = НовоеФото.ПолучитьДвоичныеДанные();
		Объект.Фото = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	КОнецЕсли;
		
	#КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.Статус = Перечисления.СтатусыДоставок.ОтклоненКлиентом ИЛИ
			Объект.Статус = Перечисления.СтатусыДоставок.ОтклоненКурьером Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "Объект.Комментарий";
			Сообщение.Текст = "Необходимо заполнить поле комментарий";
			Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти