
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	//ЗарегистрироватьКОбмену();
	
КонецПроцедуры

Процедура ЗарегистрироватьКОбмену()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ОбменСЦентральнойБазой.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	ПланОбмена.ОбменСЦентральнойБазой КАК ОбменСЦентральнойБазой
	//               |ГДЕ
	//               |	НЕ ОбменСЦентральнойБазой.ПометкаУдаления";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//МассивУзлов = Новый Массив;
	//
	//Пока Выборка.Следующий() Цикл
	//	ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	//КонецЦикла;

КонецПроцедуры